Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/F39B.tmx
Source language: en_us
Languages: zh_cn

source: This ancient Hawaiian philosophy will change your life and make the world a better place
zh_cn: 改变生活，让世界更美好的古老夏威夷理念

source: The world seems kind of depressing these days, doesn't it?
zh_cn: 这个世界最近似乎有点令人沮丧，不是吗？

source: Implosion in the Middle East.
zh_cn: 中东国家里的混乱。

source: Xenophobia in the West.
zh_cn: 西方国家里的排外主义。

source: Greed, terrorism, climate change, terrifying viruses, the 2016 presidential race.
zh_cn: 贪婪、恐怖主义、气候变化、可怕的病毒、2016年的总统竞选。

source: It's enough to make you want to pull the covers over your head and never get out of bed.
zh_cn: 这一切足以让你想用被盖盖过你的头，永远不要下床。

source: To which I say, aloha.
zh_cn: 我要对你说，“阿罗哈”。

source: During tough times like these, humanity could benefit from this ancient Hawaiian philosophy.
zh_cn: 像这样的艰难时刻里，人类可以从这一古老的夏威夷理念受益。

source: Now, most mainland Americans think "aloha" means "hello," "goodbye," or sometimes "love," and all of that is true.
zh_cn: 现在，大部分的美国本土人认为“阿罗哈”的意思是“你好”，“再见”，或者有时候是“爱”，而这些都是正确的。

source: But it also means much, much more.
zh_cn: 但它的意义还有很多很多。

source: The late Haleaka Iolani Pule, a Hawaiian historian and healer, called aloha the "symbiotic relationship and an acknowledgement of that relationship you have with everything in the universe around you, and recognizing exactly what your space within that is."
zh_cn: 已故的夏威夷历史学家和治疗师哈雷阿卡·伊奥拉尼·普乐（Haleaka Iolani Pule）将“阿罗哈”称为“你和周围的宇宙万物之间的共生关系，你对那份关系的承认，以及你对自己在那份关系之中的确切位置的意识。”

source: I know what you're thinking: That sounds like some bizarre new-age philosophy.
zh_cn: 我知道你在想什么：这听起来像是某种奇怪的新时代理念。

source: But bear with me.
zh_cn: 但是，请耐心听我说。

source: There's some good social science in aloha; it just needs to be unpacked a little.
zh_cn: “阿罗哈”之中含有一些很好的社会科学；它只是需要稍微分解一下。

source: When I first moved to Hawaii from the mainland, my limited understanding of aloha was summed up in a general impression of "nice-ness."
zh_cn: 当我刚从本土搬到夏威夷的时候，我对“阿罗哈”有限的了解，可以概述为一种整体的“好”的印象。

source: "How nice everyone is here," I would say to my husband.
zh_cn: “这里所有的人真好。”我会对我的丈夫说。

source: In Hawaii, drivers wave each other through traffic, and no one (except the occasional tourist) uses a car horn, even though Honolulu has some of the worst traffic in the country.
zh_cn: 在夏威夷，司机会通过交通彼此挥手；虽然檀香山有美国的一些最严重的车流量，但没有人（除了偶尔的旅客之外）会使用汽车喇叭。

source: "She's so nice," I would think about Carol, the checkout clerk at Safeway who seemed really interested in why I favored a particular brand of dish soap.
zh_cn: “她人真好。”我会想起在西夫韦（超市）当收银员的卡罗尔。她似乎对我为什么偏爱某品牌的洗碗剂很感兴趣。

source: Aloha meant Carol knew our new hanai daughter from China had dietary preferences that sometimes baffled me.
zh_cn: “阿罗哈”意味着卡罗尔知道我们从中国领养过来的女儿有一些有时会让我困惑的饮食偏好。

source: It's why Carol let me know whenever there was a sale on frozen hashed browns.
zh_cn: 这就是为什么每当有冷冻土豆煎饼促销的时候，卡罗尔就会通知我。

source: Aloha made me privy to the fact that Carol hurt her arm on the job, and why I was able to contribute to her get-well present.
zh_cn: “阿罗哈”让我知道卡罗尔上班的时候胳膊受伤，也让我能够为她出点钱买一份祝她早日康复的礼物。

source: Indeed, this "nice-ness" is a direct result of aloha.
zh_cn: 的确，这样的“好”，是“阿罗哈”的直接效果。

source: People in my adopted island home talk about "driving with aloha," "speaking with aloha," and even "working out with aloha," which, according to the sign at my gym, means sharing equipment and wiping it down after use.
zh_cn: 我寄居的岛屿上的人会谈论着“带着阿罗哈驾驶”，“带着阿罗哈说话”，甚至“带着阿罗哈健身”；根据我的健身房里的标志，它的意思是要分享设备，也要在使用后擦拭设备。

source: Aloha is manifest in the strong, full kiss you get on the face whenever you meet someone in Hawaii.
zh_cn: “阿罗哈”的表现，就在每当你在夏威夷跟人见面的时候，脸上就会接到一次又强烈又完整的吻。

source: It is the genuine interest in others implicit in the Hawaiian tradition of engaging in friendly and personal conversation, or "talking story," over every encounter.
zh_cn: “阿罗哈“就是，当人们每次和别人相遇的时候，他们就会像夏威夷传统中一般，与对方进行友善的亲切对话，或者“说话的故事”，从而向对方表现出真正的兴趣。

source: These practices can surprise (and sometimes irritate) newcomers; after all, in many cultures, people don't like to be kissed by strangers, and when you're in a hurry, answering the postal clerk's curious questions about the son to whom you are sending a package can be a little maddening.
zh_cn: 这些做法可能会让新来的人感到惊喜（或者有时候是恼火）。毕竟，在许多文化中，人们不喜欢被陌生人亲吻；当你在赶时间，给儿子送出一个包裹的时候，向好奇的邮政人员回答有关你儿子的问题，可能会让你稍微发狂。

source: But these practices - and the aloha that drives them - literally force humans to connect with each other.
zh_cn: 但这些做法——以及驱动它们的“阿罗哈”——简直会迫使人们相互联系。

source: And when you are connected with others, it's hard to follow the very human instinct to put yourself and your biological family above others.
zh_cn: 当你和他人联系的时候，你很难遵循那非常人性的本能，将自己和亲生家人放在他人之上。

source: By extension, aloha connects humans with the natural world, putting individual humans into context with animals, plants, and the Earth.
zh_cn: 推而广之，“阿罗哈”使人类与自然世界联系起来，让每一个人和动物、植物和地球之间产生共鸣。

source: Over time, I began to understand just how powerful a social construct aloha really is.
zh_cn: 随着时间的过去，我开始明白“阿罗哈”这个社会建构其实有多强大。

source: It is subjugating the urge to benefit oneself at risk of upsetting the delicate balance of life.
zh_cn: 它是抑制为了自身利益而冒险扰乱生命的微妙平衡的欲望。
